Revit 2027 API
BuiltInFailures.AssemblyFailures.AssemblyInheritTypeWarn Property
 Edits to these assemblies do not match existing types, new type will be created.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AssemblyInheritTypeWarn { get; }
Public Shared ReadOnly Property AssemblyInheritTypeWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AssemblyInheritTypeWarn {
	FailureDefinitionId^ get ();
}
static member AssemblyInheritTypeWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AssemblyFailures Class
Autodesk.Revit.DB Namespace